

// #1

// answer


//console.log(myString[]);
/*
    შექმენი ახალი ცვლადდი myString და მიანიჭე მას მნიშვნელობა "Pablo Eskobar was a realy nice guy, When I grow up I want to just be like him!"

    გამოიტანე კონსოლში ამ სტრინგის ზომა (სიმბოლოების რაოდენობა);
    პირველი სიმბოლო, მე-9 სიმბოლო.
    ციკლის გამოყენებით ჩამოწერე სტრინგში შემავვალითითოეული სიმბოლო.?
*/



// #2

// answer


/*  
    შექმენი ცვლადი animal და მიანიჭე მას რაიმე მნიშვნლობა.
    სვიჩის საშუალებით შეადარე ის კატას, ძაღლს, ძროხას, მგელს, ზარმაცას და მელიას.
    ცოვეელის წარმატებით შედარბის შემთხვევაში გამოატანინე კრანზე შესაბამისი ხმა მაგალითად cow: console.log("Mooooo");
    თუ ცხოველი ვერ იპოვა დეფალტად გამოატანინე შემდეგი ტექტი "old MCdonads had a farm, deliav ranuni"
*/



// #3

// answer




/*
    შექმნი მასივი myArray და მასში ჩაყარე შმდეგი მონაცემები: 1,"text","koba",null,"popkorni",79,true.
    კონსოლში გამოიტანე მასივის ზომა (მასში არსსბულელემენტთა რაოდენობა);
    კონსოლში დაბეჭდე მასივის თითოეული ელემნტი, ციკლის გამოყენბით.

*/


// #4

// answer





/*
    შექმენი უპარამეტრო ფუნქცია სახელად somexiPhrase და მისი გამოძახებით კონსოლში გამოიტანოს ტექსტი "Vaaaax Cavaataneem!".
    შექმენი ფუნქცია სახელად getWhatsLeft რომელიც მიიღებს პარამეტრად a და b რიცცხვბს და დაგვიბრუნებ a-ს b-ზე გაყოფით მიღებულ ნაშთს.

    შექმენი ახალი ცვლადი და ფუნქციის საშუალებით მიანიჭე 15 ის 9ზე გაყოფით მიღებული ნაშთი. 
    დამიწერე ამ ცვლადის მნიშვნელობა კონსოლში
*/


// #5
// answer




/*
    შექმენი პარამეტრიანი ფუნქცია რომელსაც თუ გადავცემთ რაიმე რიცხვს დაგვიბრუნებს მის კვადრატს.
    შექმენი პარამეტრიანი ფუნქცია რომელსაც თუ გადავცემთ მართკუთხა სამკუთხედის კათეტების სიგრძეებს დაგვიბრუნებს სსამკუთხედის ფართობს.
    შექმენი პარამეტრიანი ფუნქცია რომელსაც თუ გადავცემთ მართკუთხა სამკუთხედის კათეტების სიგრძეებს დაგვიბრუნებს ჰიპოტენუზის სიგრძეს.
    ყველა შექმნილი ფუნქცია გმოიძახე სათითაოდ.
*/


// #6
// answer







/*
        Try Catch

        შექმენი ესეთი სიტოაცია. შენ გაქვს ორი რიცხვის გაყოფა a და b რიცხვებით. სადაც b არის გამყოფი. a:b  =...  .
        იმ შემთვევაში თუ b= 0  გამოისროლე Exception-ი.
        იმ შემთხვეევაში თუ Exception გამოისროლა კონსოლში გამოიტანე წარწერა "cant devide on 0!"
        საბოლოოდ ერორი გინდ მოხდეს გინდ არა გამოტან წარწერა "this task is done"
*/



// #6 
// answer





/*

    შექმენი ობიექტი blackCat
    რომელსაც ექნება თვისებები: თვალის ფერი, წონა, მაძღარია თუ არა, სახელი, საყვარელი ფრაზა
    და ექნება მეთოდები:
    1. changeHungerState რომელი თუ მაძღარიში წერია კი მაშშინ არად გადააკეთებს თუარადა პირიქით (hint: მაძღარია თუ არა უნდა იყოს boolean ანუ true false)
    2. gainwaight რომელსაც გადაეემაა რაიმე რიცხვი და ამ რიცხვს უმატებს კატის ამჭამინდლ წონას.
    3. getName რომელიბ გვიბრუნებს სახელს.
    4. setPhrase რომელიც უცვლის ფრაზას.

    დამიწერე კონსოში ობიექტის სათითაო თვისება შემდეგი ფორმატით "name = სახელი" და ა.შ

    მეთოდეის გამოყენებით
    შეუცვალე მაძღრობის სტატუსი და დამიბეჭდე.
    გაასუქე 3 კილოთი და დაბეჭდე.
    გახდეს 2 კილოთი და დაბეჭდე.
    დამიბეჭდე სახელი.
    ახალი ფრაზა მიანიჭე "Came Here to Deliver Some Bad Luck."
    დაბეჭდე ეგ ფრაზა.




    ახალი თვისება გაუწერე owner რომელსაც ექნება ორი თვისება name surname
    დამიბეჭდე owner ის მონაცემები.
*/



// #7
// answer




/*
    წინა ჯავასკრიპტ ობექტი გადაიყვანე ჯისონის ობიექტად და დამიბეჭდე.
    
*/










