//#1//


// answer


// #1
/*
    შექმენი ცვლადი სახელად number1 და მიანიჭე მას მნიშვნელობად 9.
    შექმენი ცვლადი სახელად number2 და მიანიჭე მას მნიშვნელობად 7.7 .
    შექმენი ცვლადი სახელად greeting და მიანიჭე მას მნიშვნელობად "Hello".
    შექმენი ცვლადი სახელად cuteAnimal და მიანიჭე მას მნიშვნელობა "Black Cat".

    შექმენი ახალი ცვლადი sum1 და ამიანიჭე მას number1-ისა და number2-ის ჯამი.
    დაბეჭდე "sum1 = შედეგი"   (შედეგის ადგილას ჩაწერილი იყოს მნიშვნლობა)

    ცვლადების გამოყენებით კონსოლში ერთ ხაზზე დადბეჭდე "Hello Black Cat"

    შექმენი null ტიპის ცვლადი შექმნი undifined ტიპის ცვლადი და ორივ დაბეჭდე.
*/







//#2//

// answer

// #2
/*
    შექმენი ცვლადი name და მიანიჭე "tamuna". შექმენი ცვლადი hobby და მიანიჭე "programming".

    ამ ორი ცვლადი გამოყენებით გამოტანე შემდეგი წარწერა:
    "tamuna loves programming, she hopes to become very good at programming. tamuna is good girl. programming is for cool kids."

    ცვლადებს name და hobby მიანიჭე შემდეგი მნიშვნელობები "Obama" და "Presidenting".

    წინა წარწერა გამოიტანე თავიდან ცვლადების ახალი მნიშვნელობბით.
*/







//#3//

// answer

// #3
/*
შექმენი სამი ცვლადი num1 num2 text1 და მიანიჭე მნიშვნელობები 9 8 "MyText";
ცვლადების გამოყენებით გამოიტანე ეკრანზე შემდგი ორი წარწერა  "17MyText" "MyText98"

*/




//#4//


// answer

// #4
/*
    ეკრანზე დამიბეჭდე რიცხვები 1 დან 50ის ჩათვლით.

    ეს გააკეთე სასმივე ციკლის გამოყენებით. (ანუ სამნაირად)ს
*/
// #5

// answer

// #5
/*
    ნებისმიერი ციკლის გამოყენებით ეკრანზე დამიბეჭდე ლუწი რიცხვები 2 დან 100მდე

    გამოტოვე იტერაცია (ის შემთხვევა) როდესაც უნდა დაბეჭდოს 44   ან  78.

*/


//#6//

// answer



// #6 
/*

ბრაუზერის ეკრანზე ამოაგდდე შემდეგი შეტყობინება

"ყველა დავალება წარმატბითაა შესრულებული"

*/