/*
ტესტის აღწერა:
რაოდენობა        - 14 დავალება
შესრულების დრო  - 2 სთ       

შეფასების ტიპი: არ გვაქვს. ჩვენ მიზანია ვიპოვოთ ჩვენს ცოდნაში ბზარები, რათა შემდეგ ცოდნის ხარისხი გავზარდოთ 
                შესაბამისი თემის უკეთ გააზრებით და არა ის რომ ქულა მივასტიკეროთ ჩვენს ცოდნას.

შევსებულ ტესტს განვიხილავთ ერთად, ტესტირების დასრულებისთანავე

Good Luck, Hail Hitler!
*/

///////////////////////////////////////////////////////////////////////////////////
///////////////////////////////  Task 1 - ცვლადები ///////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
    შექმენი ცვლადი სახელად number1 და მიანიჭე მას მნიშვნელობად 93.
    შექმენი ცვლადი სახელად number2 და მიანიჭე მას მნიშვნელობად 7 .

    კონსოლში გამოიტანე წარერა "93 % 7 = (მნიშვნელობა)".  (მნიშვნელობა) -> აქ ჩაწერე 93 ის 7ზე გაყოფით მიღებული ნაშთი (ცვლადების გამოყენებით)
    

    შექმენი ცვლადი სახელად greeting და მიანიჭე მას მნიშვნელობად "Hello".
    შექმენი ცვლადი სახელად cuteAnimal და მიანიჭე მას მნიშვნელობა "NineTailed Fox".


    ცვლადების გამოყენებით კონსოლში ერთ ხაზზე დადბეჭდე "Hello NineTailed Fox"

    შექმენი ორი ცვლადი st1 და st2 და მიანიჭე ეს მნიშვნელობა "One day in the" და "year of the fox"
    ცვლადების ერთ ხაზად დამიბეჭდე ტექსტი ისე რომ სიტყვები არ მიატყუპოს. "One day in the(აქ არ მიატყუპოს)year of the fox"

    ცალცალკე ახზე დამიბეჭდე ეს ტექსტები ცვლადების გამოყენების გარეშე ერთი კონსოლ ლოგის გამოყენებით (შეხსენბა: ხაზის ქვემოთ ჩმოსატანად შეგიძლია გამოიყენო ეს - "\n" )
    "Came the time remembered well
    When a strong young man of the rising
    Sun with the tolling of the great bell"

    შექმენი null ტიპის ცვლადი შექმნი undifined ტიპის ცვლადი და ორივ დაბეჭდე.
*/





///////////////////////////////////////////////////////////////////////////////////
///////////////////////////  Task 2 - strings & numeber ///////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
შექმენი სამი ცვლადი num1 num2 text1 და მიანიჭე მნიშვნელობები 21 8 "HappyProgrammingDay";
ცვლადების გამოყენებით გამოიტანე ეკრანზე შემდგი ორი წარწერა  "29HappyProgrammingDay" "HappyProgrammingDay821"

*/





///////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Task 3 - ციკლები ////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
    ეკრანზე დამიბეჭდე 3 ის ჯერადი რიცხვები 1 დან 50ის ჩათვლით.

    ეს გააკეთე სასმივე ციკლის გამოყენებით. (ანუ სამნაირად)
*/






///////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Task 4 - ციკლები ////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
ბრაუზერის ეკრანზე ამოაგდდე შემდეგი შეტყობინება

"სიზარმაცე ჭკვიანი პროგრამისტის აუცილებელი თვისებაა"
*/






///////////////////////////////////////////////////////////////////////////////////
///////////////////////////////  Task 5 - სტრინგები ///////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
შექმენი ახალი ცვლადდი myString და მიანიჭე მას მნიშვნელობა "Santa Claus is Real, you better belive me or you won't get the new Iphone you wished for, you little motherFu**er!"

    გამოიტანე კონსოლში ამ სტრინგის ზომა (სიმბოლოების რაოდენობა);
    პირველი სიმბოლო, 15-ე სიმბოლო.
    ციკლის გამოყენებით ჩამოწერე სტრინგში შემავვალითითოეული სიმბოლო.
*/






///////////////////////////////////////////////////////////////////////////////////
//////////////////////////  Task 6 - ობიექტები თვისებები //////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
შექმენი ობიექტი car რომელსაც ექნბა სამი თვისება model, color, speed

სვიჩის გამოყენებით car-ის თვისება color შეადარე შემდეგ მონაცემებს "red","blue","green"

თუ მანქანა არის წითელი გამოიტანე ტექსტი: "Car's color = (ფერი), model=(მოდელი),speed = (სიჩქარე)". ფრჩხილებში დაწერილი ტექსტის ნაცვლად გამოჩნდეს მნიშვნელობები
თუ მანქანის ფერი იქნება სხვა მაშინ ამოვიდეს წარწერა "you've got some wierd car, bro"

*/






///////////////////////////////////////////////////////////////////////////////////
///////////////////////////////  Task 7 - ფუნქციები ///////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
შექმენი ფუნქცია printMyArray რომელსაც პარამეტრად გადაეცემა arr  ანუ მასივი [ hint: printMyArray(arr){ კოდი }  ]

და ციკლის საშუალებით დაბეჭდავს ამ მასივის ყველა ელმენტს კონსოლში.

*/



///////////////////////////////////////////////////////////////////////////////////
//////////////////////////////  Task 8 - ფუნქციები 2 //////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
შექმენი მასივი სადაც ჩაყრი შემდეგ მონაცემებს :   "generali kutuzovi","hitleri","stalini","gela",77,true,false.

წინა ფუნქციის გამოყენბით დაბეჭდე ყველა ელემენტი
*/






///////////////////////////////////////////////////////////////////////////////////
//////////////////////////  Task 9 - ობიექტები მეთოდები //////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*

შექმენი ობიექტი Keybord 
    რომელსაც ექნება შემდეგი თვისებები: 
    - keyNumber, OctaveNumber, Material, isBeautiful (ეს ბულეან ტიპის)
    
    და ასევე ექნება მეთოდები: 
    - print რომელიც დაბეჭდავს "keyNumber = (..), OctaveNumber = (..), Material = (..), isBeautiful = (..)"  ფრჩხილების ადგილას შესსაბამისი მნიშვნეობები


    შექმენი ასეთი ობიექტი სადაც სატყისი material- იქნება "wood"
    შემდეგ matrial-ის მნიშვნელობა  შეუცვალე "cool wood" ით.
    და დამიბეჭდე მეთოდის გამოყენებით

*/






///////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Task 10 - if else ///////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
//     შექმენი ბულეან ტიპის ცვლადი sunnyDay

//     თუ sunnyDay ჭეშმარიტია (true) კონსოლში დააბეჭდინე "such a sunny day"
//     თუ არა დააბეჭინე "i love bad weather :3 "//





///////////////////////////////////////////////////////////////////////////////////
//////////////////////////////  Task 11 - if else  2 //////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
//     შექმენი ცვლადი person

//     თუ person უდრის "Fraddie Mercury" დააბეჭდინე "Freddie is Legendary Vocalist!"
//     თუ person უდრის "John Deacon" დააბეჭდინე "John Deacon is Legendary Bassist!"
//     თუ person უდრის "Roger Taylor" დააბეჭდინე "Roger Taylor is Legendary Drummer!"
//     თუ person უდრის "Brain May" დააბეჭდინე "Brain May is Legendary Guitarist!""
//     თუ აქედან არცერთს არ უდრის დააბეჭდინე "who the hell is that?"

//     !! არ !! გამოიყენო სვიჩი/
// */





///////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Task 12 - ციკლები ///////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
// 12.1
//     მოცემულია პროგრამული კოდის ფრაგმენტი:
//     var sum =0;
//     for(var i = 1; i<21;i++){
//         sum+=i;
//     }
//     console.log("sum - "+sum);
//     (მოცემული კოდი ითვლის 1 დან 20 მდე რიცხვების ჯამს)

//     ეს კოდი გადამიკეთე ისე რომ გამოიყენო while ციკლი for ის ნაცვლად





// 12.2
//     მოცემულია პროგრამული კოდის ფრაგმენტი:


//     var i=0;
//     while(i<31){
//         if(i%3==0){
//             console.log("i%3=0");
//         } else{
//             console.log("i ar aris 3-is jeradi");
//         }
//         i++;
//     }


//     გადამიკეთე ეს კოდი for ციკლის გამოყენებით

// */


///////////////////////////////////////////////////////////////////////////////////
///////////////////////////  Task 13 - ფუნქციები/მასივები //////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
    შექმენი PrintArray ფუნქცია რომლსაც პარამეტრად გადაეცემა arr მასივი და დაბეჭდავს მის ყველა ელემენტს.
    შექმენი myArray მასივი რომლიც შეიცავს შემდეგ მონაცემებს: "elment1","element2",true,35,-100.
    PrintArray ფუნქციის გამოძახებით დაბეჭდე myArray-ის ყველა ელემენტი.
*/


    

///////////////////////////////////////////////////////////////////////////////////
///////////////////////////////  Task 14 - ობიექტები //////////////////////////////
///////////////////////////////////////////////////////////////////////////////////
/*
    შექმენი ობიექტი BigBrother
    
    რომელსაც ექნება შემდეგი თვისებები:
    - name              (string)
    - surname           (string)
    - age               (number)
    - isStrong          (boolean)

    და ექნება შემდეგი მეთოდები:

    - Protect               - თუ  isStrong-ის მნიშვნლობა არის true დაბეჭდავს "I will Protect Everybody!" თუ არადა დაბეჭდავს "I must get Stronger!."  (უპარამეტრო მეთოდი)
    - changeStrenghtState   - თუ  isStrong-ის მნიშვნლობა არის true მას მნიშვნლობად მიანიჭებს false-ს და თუ არის false მაშინ true-ს.   (უპარამეტრო მეთოდი)
    - Print                 - დაბეჭდავს მთელ ობიექტს შემდდგნაირად: "name = (..), surname = (..), age = (..), isStrong = (..)"   (უპარამეტრო ფუნქცია) (უპარამეტრო მეთოდი)
                              ფრჩხილების ადგილას შესსაბამისი მნიშვნეობები


    გამოიძახე Protect, Print, changeStrenghtState, Print.   (იმ თანმიმდევრობით როგორც აქ წერია)

*/