// answer




// #1
/*
    შექმენი ცვლადი სახელად number1 და მიანიჭე მას მნიშვნელობად 93.
    შექმენი ცვლადი სახელად number2 და მიანიჭე მას მნიშვნელობად 7 .

    კონსოლში გამოიტანე წარერა "93 % 7 = (მნიშვნელობა)".  (მნიშვნელობა) -> აქ ჩაწერე 93 ის 7ზე გაყოფით მიღებული ნაშთი

    შექმენი ცვლადი სახელად greeting და მიანიჭე მას მნიშვნელობად "Hello".
    შექმენი ცვლადი სახელად cuteAnimal და მიანიჭე მას მნიშვნელობა "Black Cat".


    ცვლადების გამოყენებით კონსოლში ერთ ხაზზე დადბეჭდე "Hello Black Cat"

    შექმენი ორი ცვლადი st1 და st2 და მიანიჭე ეს მნიშვნელობა "One day in the" და "year of the fox"
    ცვლადების ერთ ხაზად დამიბეჭდე ტექსტი ისე რომ სიტყვები არ მიატყუპოს. "One day in the(აქ არ მიატყუპოს)year of the fox"

    ცალცალკე ახზე დამიბეჭდე ეს ტექსტები ცვლადების გამოყენების გარეშე ერთი კონსოლ ლოგის გამოყენებით (შეხსენბა: ხაზის ქვემოთ ჩმოსატანად შეგიძლია გამოიყენო ეს - \n )
    "Came the time remembered well
    When a strong young man of the rising
    Sun with the tolling of the great bell"

    შექმენი null ტიპის ცვლადი შექმნი undifined ტიპის ცვლადი და ორივ დაბეჭდე.
*/






// #2

// answer




/*
შექმენი სამი ცვლადი num1 num2 text1 და მიანიჭე მნიშვნელობები 20 9 "HappyProgrammingDay";
ცვლადების გამოყენებით გამოიტანე ეკრანზე შემდგი ორი წარწერა  "29HappyProgrammingDay" "HappyProgrammingDay920"

*/






// #3
// answer





/*
    ეკრანზე დამიბეჭდე 3 ის ჯერადი რიცხვები 1 დან 50ის ჩათვლით.

    ეს გააკეთე სასმივე ციკლის გამოყენებით. (ანუ სამნაირად)
*/






// #4
// answer




// sendText();
/*

ბრაუზერის ეკრანზე ამოაგდდე შემდეგი შეტყობინება

"სიზარმაცე ჭკვიანი პროგრამისტის აუცილებელი ატრიბუტია"

*/






// #5
// answer




/*
შექმენი ახალი ცვლადდი myString და მიანიჭე მას მნიშვნელობა "Santa Claus is Real, you better belive me or you won't get the new Iphone you wished for, you little motherFu**er!"

    გამოიტანე კონსოლში ამ სტრინგის ზომა (სიმბოლოების რაოდენობა);
    პირველი სიმბოლო, 15-ე სიმბოლო.
    ციკლის გამოყენებით ჩამოწერე სტრინგში შემავვალითითოეული სიმბოლო.
*/






// #6

// answer





/*
შექმენი ობიექტი car რომელსაც ექნბა სამი თვისება model, color, speed

სვიჩის გამოყენებით car-ის თვისება color შეადარე შემდეგ მონაცემებს "red","blue","green"

თუ მანქანა არის წითელი გამოიტანე ტექსტი: "Car's color = (ფერი), model=(მოდელი),speed = (სიჩქარე)". ფრჩხილებში დაწერილი ტექსტის ნაცვლად გამოჩნდეს მნიშვნელობები
თუ მანქანის ფერი იქნება სხვა მაშინ ამოვიდეს წარწერა "you've got some wierd car, bro"

*/






// #7


// answer







/*
შექმენი ფუნქცია printMyArray რომელსაც პარამეტრად გადაეცემა arr  ანუ მასივი [ hint: printMyArray(arr){ კოდი }  ]

და ციკლის საშუალებით დაბეჭდავს ამ მასივის ყველა ელმენტს კონსოლში.

*/






// #8

// answer




/*
შექმენი მასივი სადაც ჩაყრი შემდეგ მონაცემებს :   "generali kutuzovi","hitleri","stalini","gela",77,true,false.

წინა ფუნქციის გამოყენბით დაბეჭდე ყველა ელემენტი
*/






// #9
// answer




/*

შექმენი ობიექტი Keybord 
    რომელსაც ექნება შემდეგი თვისებები: 
    - keyNumber, OctaveNumber, Material, isBeautiful (ეს ბულეან ტიპის)
    
    და ასევე ექნება მეთოდები: 
    - print რომელიც დაბეჭდავს "keyNumber = (..), OctaveNumber = (..), Material = (..), isBeautiful = (..)"  ფრჩხილების ადგილას შესსაბამისი მნიშვნეობები


    შექმენი ასეთი ობიექტი სადაც სატყისი material- იქნება "wood"
    შემდეგ matrial-ის მნიშვნელობა  შეუცვალე "cool wood" ით.
    და დამიბეჭდე მეთოდის გამოყენებით

*/